src/Documents/ПродажаТоваров/ПродажаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаТоваров</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПродажаТоваров/Forms/ФормаДокумента/Module.bsl
&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьСумму(ТекСтрока)
	ТекСтрока.Сумма = ТекСтрока.Цена * ТекСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ДатьСкидкуВМО(Команда)
	ДатьСкидкуВМОНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатьСкидкуВМОНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ДатьСкидкуОбъект();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.СуммаДокумента = Объект.Товары.Итог("Сумма");
КонецПроцедуры


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ИзменитьСумму(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ИзменитьСумму(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	Товар = ТекСтрока.Товар;
	ТекСтрока.Цена = ПолучитьЦенуТовара(Товар);
	ИзменитьСумму(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ДатьСкидку(Команда)
	ДатьСкидкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатьСкидкуНаСервере()
	Для Каждого стр Из Объект.Товары Цикл
		стр.Цена = стр.Цена * 0.9;
		ИзменитьСумму(стр);
	КонецЦикла;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьЦенуТовара(Товар)
	
	Возврат Товар.ЦенаПродажи;
	
КонецФункции
